#ifndef __rnd__
#define __rnd__

#include <cstdlib>

//------------------------------------------------------------------------------
// rnd.h - содержит генератор случайных целых и дробных чисел.
//------------------------------------------------------------------------------

//Генерация рандомного целого числа.
inline auto Random() {
    return rand() % 20 + 1;
}

// Генерация рандомного дробного числа.
inline auto RandomDouble() {
    return 10 + (double) (rand()) / ((double) (RAND_MAX / (100 - 10)));
}

#endif //__rnd__
