//------------------------------------------------------------------------------
// sphere.cpp - содержит функции обработки шара
//------------------------------------------------------------------------------

#include "sphere.h"

//------------------------------------------------------------------------------
// Ввод параметра шара из потока
void In(sphere &s, ifstream &ifst) {
    ifst >> s.r;
}

// Случайный ввод параметра шара
void InRnd(sphere &s) {
    s.r = Random();
    s.density = RandomDouble();
}

//------------------------------------------------------------------------------
// Вывод параметров шара в поток
void Out(sphere &s, ofstream &ofst) {
    ofst << "It is Sphere: r = " << s.r
         << ". SurfaceArea = " << SurfaceArea(s) << "\n";
}

//------------------------------------------------------------------------------
// Вычисление площади поверхности шара
double SurfaceArea(sphere &s) {
    return 4 * 3.14 * s.r;
}
