#ifndef __extdata__
#define __extdata__

//------------------------------------------------------------------------------
// extdata.h - Описание внешних данных.
//------------------------------------------------------------------------------

//------------------------------------------------------------------------------
// Раздел констант.
//------------------------------------------------------------------------------

// Константа, определяющая размер целого числа.
extern int const intSize;
// Константа, определяющая размер дробного числа.
extern int const doubleSize;
// Константа, задающая размер для параллелепипеда.
extern int const paralSize;
// Константа, задающая размер для тетраэдра.
extern int const tetrSize;
// Константа, задающая размер для шара.
extern int const sphereSize;
// Константа, задающая размер для обобщенной фигуры.
extern int const shapeSize;
// Константа, определяющая размерность массива фигур.
extern int const maxSize;
// Константа, задающая признак параллелепипеда.
extern int const PARALLELEPIPED;
// Константа, задающая признак тетраэдра.
extern int const TETRAHEDRON;
// Константа, задающая признак шара.
extern int const SPHERE;


#endif
