//------------------------------------------------------------------------------
// sphere.cpp - содержит функции обработки шара.
//------------------------------------------------------------------------------

#include "sphere.h"

//------------------------------------------------------------------------------
void In(sphere &s, FILE *ifst) {
    int rValue;
    if (fscanf(ifst, "%d", &rValue) != EOF) {
        s.r = rValue;
    }
}

void InRnd(sphere &s) {
    s.r = Random();
}

//------------------------------------------------------------------------------
void Out(sphere &s, FILE *ofst) {
    fprintf(ofst, "It is Sphere: r = %d. SurfaceArea = %f.\n", s.r, SurfaceArea(s));
}

//------------------------------------------------------------------------------
double SurfaceArea(sphere &s) {
    return (double) 4 * 3.1415 * s.r;
}
